Merge pull request #41 from barisozy/docs/update-readme
Improve README with badges and mermaid diagram
